<?php

/*
    |--------------------------------------------------------------------------
    | Строки языка для аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие строки используются во время аутентификации для различных
    | сообщений, которые мы должны отображать пользователю. Вы можете
    | изменять эти строки в соответствии с требованиями вашего приложения.
    |
    */

return [
    'registration' => 'Регистрация',
    'name' => 'Имя',
    'gender' => 'Ваш пол',
    'male' => 'Мужской',
    'female' => 'Женский',
    'dob' => 'День рождения',
    'day' => 'День',
    'month' => 'Месяц',
    'year' => 'Год',
    'goal' => 'Цель знакомства',
    'friends' => 'Поиск друзей',
    'romantic' => 'Романтические отношения',
    'family' => 'Создание семьи',
    'travel' => 'Путешествия',
    'casual' => 'Свободные отношения',
    'final_step' => 'Последний этап',
    'city' => 'Город',
    'email' => 'Почта',
    'password' => 'Пароль',
    'confirm_password' => 'Подтверждение пароля',    
    'confirm_password_before_continuing' => 'Пожалуйста, подтвердите ваш пароль перед продолжением',

    'welcome_back' => 'С возвращением',
    'sign_in_account' => 'Войдите в свой аккаунт',
    'have_account' => 'Нет аккаунта?',
    'forgot_password' => 'Забыли пароль?',
    'remember_me' => 'Запомнить меня',

    'ph_name' => 'Введите ваше имя',
    'ph_email' => 'Введите вашу почту',
    'ph_password' => 'Введите ваш пароль',
    'ph_city' => 'Введите ваш город',
    'ph_create_password' => 'Создайте пароль',

    'sign_in' => 'Войти',  
    
    'create_new_password' => 'Создать новый пароль',
    'set_new_password' => 'Установите новый пароль для вашей учетной записи',
    'new_password' => 'Новый пароль',
    'enter_new_password' => 'Введите новый пароль',
    'confirm_your_password' => 'Подтвердите ваш пароль',

    'reset_password' => 'Сбросить пароль',
    'enter_email_reset_link' => 'Введите ваш email для получения ссылки для сброса',
    'send_reset_link' => 'Отправить ссылку для сброса',
    'back_to_login' => 'Вернуться ко входу',

    'verify_email' => 'Подтвердите ваш email',
    'verify_email_continue' => 'Пожалуйста, подтвердите ваш email адрес чтобы продолжить',
    'thanks_for_signing_up' => 'Спасибо за регистрацию! Прежде чем начать, пожалуйста, подтвердите ваш email адрес, перейдя по ссылке, которую мы отправили вам на почту. Если вы не получили письмо, мы с радостью отправим вам другое.',
    'verification_link_sent' => 'Новая ссылка для подтверждения была отправлена на email адрес, указанный при регистрации.',
    'resend_verification' => 'Отправить письмо повторно',

    'check_email' => 'Проверьте электронную почту',
    'check_email_desc' => 'Для завершения регистрации, нажмите на ссылку в письме, которое мы отправили вам на:',
    'go_to_email' => 'Перейти в почту',
    'resend_email' => 'Отправить письмо повторно',
    'resend_success' => 'Новая ссылка для подтверждения отправлена на ваш email',
    'what_if_no_email' => 'Что делать, если я не получил письмо?',
    'check_spam' => 'Проверьте папку "Спам" вашего почтового ящика, наше письмо могло по ошибке попасть туда. Если это так, пожалуйста, отметьте его как "Не спам".',
    'wrong_email' => 'Указали неверный адрес?',
    'change_email' => 'Изменить почту',
    'new_email_address' => 'Новый адрес эл. почты',
    'save_and_send' => 'Сохранить и отправить',
    'cancel' => 'Отмена', // Не нужно, используй common.cancel
    'logout_account' => 'Выйти из аккаунта', // Или common.logout

    'failed' => 'Эти учетные данные не соответствуют нашим записям.',
    'failed_password' => 'Введенный пароль неверен.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, повторите попытку через :seconds секунд.',

];
