<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Строки языка для пагинации
    |--------------------------------------------------------------------------
    |
    | Следующие строки используются библиотекой пагинации для создания
    | простых ссылок навигации. Вы можете изменить их на любые другие,
    | чтобы настроить представления под ваше приложение.
    |
    */

    'previous' => '&laquo; Назад',
    'next' => 'Вперед &raquo;',

];