<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Строки языка для сброса пароля
    |--------------------------------------------------------------------------
    |
    | Следующие строки соответствуют причинам, которые возвращает
    | брокер паролей при попытке обновления пароля,
    | например, из-за недействительного пароля или токена сброса.
    |
    */

    'reset' => 'Ваш пароль был сброшен.',
    'sent' => 'Мы отправили ссылку для сброса пароля на вашу электронную почту.',
    'throttled' => 'Пожалуйста, подождите перед повторной попыткой.',
    'token' => 'Этот токен сброса пароля недействителен.',
    'user' => 'Мы не можем найти пользователя с таким адресом электронной почты.',

];