<?php

return [
    'body_type' => [
        0 => 'Нет ответа', 1 => 'Стройное', 3 => 'Спортивное', 5 => 'Есть пара лишних кило', 6 => 'Полное'
    ],
    'eye_color' => [
        0 => 'Нет ответа', 1 => 'Карие', 2 => 'Серые', 3 => 'Голубые', 4 => 'Зеленые'
    ],
    'hair_color' => [
        0 => 'Нет ответа', 1 => 'Блонд', 2 => 'Русые', 3 => 'Шатен', 9 => 'Черные', 4 => 'Рыжие', 7 => 'Седые', 6 => 'Мелированные', 8 => 'Голова бритая наголо'
    ],
    'body_decorations' => [
        1 => 'Пирсинг', 2 => 'Татуировки', 3 => 'Шрамы', 5 => 'Веснушки'
    ],
    'relationship_status' => [
        0 => 'Нет ответа', 5 => 'Свободен', 1 => 'Занят', 2 => 'Женат, живем порознь', 3 => 'Всё сложно'
    ],
    'children_status' => [
        0 => 'Нет ответа', 5 => 'Нет, и не хочу', 8 => 'Нет, и ищу без детей', 2 => 'Возможны в будущем', 6 => 'Уже есть, больше не хочу', 7 => 'Уже есть, хочу еще'
    ],
    'pets' => [
        0 => 'Нет ответа', 3 => 'Собака', 2 => 'Кошка', 5 => 'Нет', 6 => 'Нет, и не хочу', 1 => 'Да, много разных'
    ],
    'housing' => [
        0 => 'Нет ответа', 1 => 'Собственная квартира', 7 => 'Дом, коттедж', 8 => 'Снимаю квартиру', 9 => 'Снимаю комнату', 3 => 'Живу у родителей', 10 => 'Без жилья'
    ],
    'has_car' => [
        0 => 'Нет ответа', 1 => 'Нет', 3 => 'Есть'
    ],
    'education_level' => [
        0 => 'Нет ответа', 2 => 'Среднее', 3 => 'Среднее-специальное', 4 => 'Студент(-ка)', 5 => 'Неполное высшее', 6 => 'Высшее', 8 => 'Несколько высших'
    ],
    'income' => [
        0 => 'Нет ответа', 2 => 'Хватает только на основное', 3 => 'Хватает на основное и отдых', 4 => 'На всё хватает и остаётся'
    ],
    'smoking' => [
        0 => 'Нет ответа', 8 => 'Против курения', 1 => 'Не курю, но не против', 5 => 'Иногда курю', 9 => 'Курю электронные сигареты', 2 => 'Курю регулярно'
    ],
    'alcohol' => [
        0 => 'Нет ответа', 5 => 'Против алкоголя', 1 => 'Не пью, но не против', 3 => 'Иногда выпиваю'
    ],
    'languages' => [
        1 => 'Русский', 8 => 'Украинский', 2 => 'Английский', 3 => 'Немецкий', 4 => 'Французский', 5 => 'Итальянский', 6 => 'Испанский', 7 => 'Португальский', 10 => 'Арабский', 9 => 'Иврит', 11 => 'Корейский', 12 => 'Китайский', 13 => 'Нидерландский', 14 => 'Индонезийский', 15 => 'Японский', 16 => 'Шведский', 17 => 'Тайский', 18 => 'Вьетнамский', 20 => 'Турецкий', 19 => 'Хинди'
    ],
    'sports' => [
        1 => 'Бег', 2 => 'Ходьба', 3 => 'Фитнес', 4 => 'Плавание', 5 => 'Велосипед', 7 => 'Ролики', 8 => 'Лыжи', 9 => 'Качалка', 10 => 'Экстрим', 11 => 'Единоборства', 12 => 'Йога', 13 => 'Командные игры', 14 => 'Танцы', 16 => 'Футбол', 17 => 'Волейбол', 19 => 'Хоккей', 20 => 'Коньки', 22 => 'Пилатес', 23 => 'Гимнастика', 24 => 'Скалолазание', 25 => 'Тренировки на улице'
    ]
];